rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def director
    movie = Movie.find(params[:id])
    if movie.director.blank?

INSERT INTO "movies" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-03-03 06:55:29.506190"], ["updated_at", "2016-03-03 06:55:29.506190"]]
---
  def create
    @movie = Movie.create!(movie_params)